{
  "education": [
    {
      "awards_achievements": [
        "Minor in Economics"
      ],
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science",
      "duration": "2016-2021",
      "school_name": "Toronto Metropolitan University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JimmyTran",
  "highlighted_projects": [
    {
      "description": "Developed a web app for restaurants to help manage reservations with a visual representation of table availability. Users are able to colour-code each reservation to indicate if patrons have arrived or cancelled. Utilizing HTML, CSS, Javascript, React.js, Express.js, Node.js, and MongoDB, users are able to create reservations and view all reservations via a timetable.",
      "git_url": "https://github.com/JaayTran/ReservationApp",
      "name": "Reservation Management Web App"
    },
    {
      "description": "Implemented a Point of Sales system web app to allow vendors to have a cloud-based POS system to keep track of table orders. Server users are able to take table orders and print receipts while Administrator users are also able to perform CRUD operations on user accounts, menu items, and tables. HTML, CSS, Javascript, React.js, Express.js, Node.js, and MongoDB were used to create the web app.",
      "git_url": "https://github.com/JaayTran/pos",
      "name": "Point of Sales System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed an automated monitoring agent to document hardware specifications as well as resource usage of Linux nodes for data analytics. The nodes specifically ran on CentOS 7 and used Bash/Shell scripts to obtain hardware info and resource usage. The information was stored in an RDBMS via a Docker and PostgreSQL instance. Crontab was used to automate the data collection and insertion into the SQL tables.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "Grep App: Developed a Java 8 application using Lambda expressions and the Stream API that emulates the functionality of the Linux Grep tool. This tool efficiently searches for a specified pattern within files and outputs lines containing that pattern. The implementation harnesses the power of Java 8 features, including Lambdas and the Stream API, making it a versatile and platform-independent solution for performing grep-like operations.",
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Jimmy Tran",
  "others": [
    {
      "bullets": [
        "Activities: Tennis, Badminton, Ping Pong, Rock Climbing",
        "Hobbies: Board Games, Video Games, Escape Rooms",
        "Relaxation: Cooking, Watching Horror Movies"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with a team of developers to create various projects utilizing Agile philosophy to develop a diverse set of projects, learning valuable skills such as Docker, Linux/Bash, PostgreSQL, and Git.",
      "duration": "Nov 2023 - Present",
      "title": "Software Developer"
    },
    {
      "company": "Robot Boil House",
      "description": "Designed and developed multiple contract-based projects for a client, spanning reservation management, point-of-sale system, and website development using technologies such as React.js, Express.js, Node.js, MongoDB, HTML, and CSS. Achieved cost savings of $1000 annually for the client's POS system and significantly enhanced worker efficiency by reducing operation times from minutes to seconds during reservation management. The website, attracting an average of 7500 monthly visitors, successfully recaptured 10%-30% of revenue from UberEats' pick-up and delivery services.",
      "duration": "June 2021 - Sept 2023",
      "title": "Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "React.js",
      "Node.js",
      "Express.js",
      "Agile/Scrum"
    ],
    "familiar": [
      "Postman",
      "Docker",
      "MongoDB",
      "PostgresQL",
      "GraphQL"
    ],
    "proficient": [
      "JavaScript",
      "HTML/CSS",
      "Java",
      "RDBMS/SQL",
      "Linux/Bash",
      "Git"
    ]
  },
  "summary": "As a Computer Science graduate from Toronto Metropolitan University, I hold a minor in economics and specialize in software engineering. As a Software Developer at Jarvis Consulting, I actively cultivate my skills by tackling diverse and challenging projects. In a previous role, I developed impactful solutions to a restaurant's website, POS system, and Reservation Management app. My passion for problem-solving and commitment to continuous learning drive my pursuit of a developer role. At Jarvis, I've gained proficiency in technologies such as Linux/Bash, SQL, and Docker to complement my knowledge in JavaScript, HTML/CSS, React.js, Node.js, Express.js, and MongoDB. Beyond work, I prioritize well-being through exercise and enjoy board and video games with friends."
}
